docs/MQ/消息队列高手课.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>消息队列高手课</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">消息队列高手课</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb693528">1. 开篇词</a></li>
<li><a href="#org67cb57c">2. 怎样学好这门课</a></li>
<li><a href="#org5960388">3. 为什么需要消息队列</a></li>
<li><a href="#orgeabe2c9">4. 该如何选择消息队列</a></li>
<li><a href="#orga2996b7">5. 消息模型</a></li>
<li><a href="#org0c41ed4">6. 如何利用事务消息实现分布式事务</a></li>
<li><a href="#org5ce253c">7. 如何确保消息不会丢失</a></li>
<li><a href="#org98ccc0d">8. 如何处理消费过程中的重复消息</a></li>
<li><a href="#org86e5dbc">9. 消息积压了该如何处理</a></li>
<li><a href="#org1aed39e">10. 答疑解惑：网关如何接收服务端的秒杀结果</a></li>
<li><a href="#orga3b0ad7">11. 学习开源代码该如何入手</a></li>
<li><a href="#org8978606">12. 如何使用异步设计提升系统性能</a></li>
<li><a href="#orgc71f975">13. 如何实现高性能的异步网络传输</a></li>
<li><a href="#orgf5d47cc">14. 序列化和反序列化：如何通过网络传输结构化的数据</a></li>
<li><a href="#org07ff662">15. 传输协议：应用程序之间对话的语言</a></li>
<li><a href="#orgfb86512">16. 内存管理：如何避免内存溢出和频繁的垃圾回收</a></li>
<li><a href="#org0a41757">17. JMQ 的 Broker 如何异步处理消息</a></li>
<li><a href="#orgd4b7ffd">18. Kafka 如何实现高性能 IO</a></li>
<li><a href="#org2109e5e">19. 缓存策略：如何私用缓存减少磁盘 IO</a></li>
<li><a href="#org8c80d50">20. 如何使用硬件同步源于（CAS）替代锁</a></li>
<li><a href="#org97778f7">21. 数据压缩：时间换空间的游戏</a></li>
<li><a href="#org7a481a8">22. RocketMQ Producer 源码分析：消息生产的实现过程</a></li>
<li><a href="#orgc121e67">23. Kafka Consumer 源码分析：消息消费的实现过程</a></li>
<li><a href="#orga563e8c">24. Kafka 和 RocketMQ 的消息复制实现的差异点在哪</a></li>
<li><a href="#org7de5f56">25. Kafka 的协调服务 ZooKeeper：实现分布式系统的瑞士军刀</a></li>
<li><a href="#org11d81ff">26. RocketMQ 和 Kafka 如何实现事务</a></li>
<li><a href="#orgb869c58">27. MQTT 协议：如何支持海量的在线 IoT 设备</a></li>
<li><a href="#org0fb9f73">28. Pulsar 的存储计算分离设计：全新的消息队列设计思路</a></li>
<li><a href="#org7d9aa67">29. 答疑解惑：我的 100 元去哪里了</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb693528" class="outline-2">
<h2 id="orgb693528"><span class="section-number-2">1</span> 开篇词</h2>
<div class="outline-text-2" id="text-1">
<p>
消息队列涉及的底层技术：
</p>
<ul class="org-ul">
<li>高性能通信</li>
<li>序列化和反序列化</li>
<li>分布式事务</li>
<li>一致性协议</li>
<li>高并发（异步编程模型）</li>
<li>数据压缩</li>
<li>内存管理</li>
<li>文件与高性能 IO</li>
<li>高可用分布式系统</li>
</ul>

<p>
常见的消息队列：
</p>
<ul class="org-ul">
<li>ActiveMQ</li>
<li>RabbitMQ</li>
<li>RocketMQ</li>
<li>Kafka</li>
<li>Pulsar</li>
<li>NSQ</li>
</ul>
</div>
</div>

<div id="outline-container-org67cb57c" class="outline-2">
<h2 id="org67cb57c"><span class="section-number-2">2</span> 怎样学好这门课</h2>
</div>

<div id="outline-container-org5960388" class="outline-2">
<h2 id="org5960388"><span class="section-number-2">3</span> 为什么需要消息队列</h2>
<div class="outline-text-2" id="text-3">
<p>
消息队列的使用场景：
</p>
<ul class="org-ul">
<li>异步处理</li>
<li>流量控制</li>
<li>服务解耦</li>
</ul>

<p>
消息队列的局限：
</p>
<ul class="org-ul">
<li>引入消息队列带来延迟问题。</li>
<li>增加系统的复杂度。</li>
<li>可能产生数据不一致问题。</li>
</ul>
</div>
</div>

<div id="outline-container-orgeabe2c9" class="outline-2">
<h2 id="orgeabe2c9"><span class="section-number-2">4</span> 该如何选择消息队列</h2>
<div class="outline-text-2" id="text-4">
<p>
标准：
</p>
<ul class="org-ul">
<li>开源产品</li>
<li>有社区</li>
<li>有生态</li>
</ul>

<p>
支持特性：
</p>
<ul class="org-ul">
<li>消息可靠传递</li>
<li>支持集群</li>
<li>性能</li>
</ul>

<p>
一线产品对比：
</p>
<ul class="org-ul">
<li>RabbitMQ
<ul class="org-ul">
<li>优点：轻量级，易于部署和使用，支持的客户端多</li>
<li>缺点：
<ul class="org-ul">
<li>消息堆积不友好，</li>
<li>性能差，几万-十几万</li>
<li>编程语言是 Erlang</li>
</ul></li>
</ul></li>

<li>RocketMQ
<ul class="org-ul">
<li>优点：
<ul class="org-ul">
<li>没有短板，</li>
<li>响应时延短，大多数情况下可以做到毫秒级响应。</li>
<li>每秒几十万。</li>
</ul></li>
</ul></li>

<li>Kafka
<ul class="org-ul">
<li>生态好</li>
<li>大量使用批量和异步的思想，获得超高的性能，这也导致同步消息响应时延比较高，不太适合处理在线业务场景。</li>
</ul></li>
</ul>

<p>
二线产品对比：
</p>
<ul class="org-ul">
<li>ActiveMQ
<ul class="org-ul">
<li>太古老了，不推荐使用。</li>
</ul></li>

<li>ZeroMQ
<ul class="org-ul">
<li>本质上不是一个消息队列。</li>
</ul></li>

<li>Pulsar
<ul class="org-ul">
<li>采用存储和计算分离的设计。可能是将来的发展方向。</li>
</ul></li>

<li>NSQ</li>
</ul>
</div>
</div>

<div id="outline-container-orga2996b7" class="outline-2">
<h2 id="orga2996b7"><span class="section-number-2">5</span> 消息模型</h2>
<div class="outline-text-2" id="text-5">
<p>
术语：
</p>
<ul class="org-ul">
<li>主题（Topic）：服务端存放消息的容器。</li>
<li>队列（Queue）</li>
<li>分区（Partition）</li>
<li>生产者、订阅者</li>
</ul>

<p>
模型：
</p>
<ul class="org-ul">
<li>队列：
<ul class="org-ul">
<li>代表：RabbitMQ</li>
<li>弊端：多个消费者需要建立多个消息队列。</li>
</ul></li>

<li>发布/订阅
<ul class="org-ul">
<li>代表：RocketMQ 等大多数</li>
<li>优点：消息可以被多个消费者消费。</li>
</ul></li>
</ul>

<p>
RocketMQ
</p>
<ul class="org-ul">
<li>主题</li>
<li>队列
<ul class="org-ul">
<li>每个主题包含多个队列，通过多个队列来实现多实例并行生产和消费。</li>
<li>RocketMQ 只在队列上保证消息的有序性，主题层面（队列间）无法保证消息的严格有序。</li>
</ul></li>
<li>订阅者
<ul class="org-ul">
<li>订阅者以消费组的形式存在，每个消费组都消费主题中的一份完整的消息。消费组之间的消费进度不受影响：同一消息可以 被不同的消费组消费。</li>
<li>消费组内有多个消费者，消费者之间消费是竞争关系，组内同一消息只能被一个消费者消费。</li>
<li>消费组内的多个消费者之间是竞争关系。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0c41ed4" class="outline-2">
<h2 id="org0c41ed4"><span class="section-number-2">6</span> 如何利用事务消息实现分布式事务</h2>
<div class="outline-text-2" id="text-6">
<p>
事务：原子性、一致性、隔离性、持久性（ACID）
</p>

<p>
常见的分布式事务实现：
</p>
<ul class="org-ul">
<li>2PC（two-phase Commit）,二阶段提交</li>
<li>TCC（Try-Confim-Cacnel）</li>
<li>事务消息：
<ul class="org-ul">
<li>使用场景：异步更新数据，对数据实时性要求不太高。</li>
</ul></li>
</ul>

<p>
RocketMQ 如何实现分布式事务，以及其中的事务反查机制。
</p>
</div>
</div>

<div id="outline-container-org5ce253c" class="outline-2">
<h2 id="org5ce253c"><span class="section-number-2">7</span> 如何确保消息不会丢失</h2>
<div class="outline-text-2" id="text-7">
<p>
检测消息是否丢失的方法：检测消息的有序性。
消息可能丢失的三个阶段：
</p>
<ul class="org-ul">
<li>生产：收到 broker 返回的响应，正确处理返回值和异常。</li>
<li>存储：正确的配置 broker 参数。</li>
<li>消费：执行完所有业务以后在发送响应消息。</li>
</ul>
</div>
</div>

<div id="outline-container-org98ccc0d" class="outline-2">
<h2 id="org98ccc0d"><span class="section-number-2">8</span> 如何处理消费过程中的重复消息</h2>
<div class="outline-text-2" id="text-8">
<p>
MQTT 协议中三种消息传递时能够提供的服务质量标准：
</p>
<ul class="org-ul">
<li>At Most Once</li>
<li>At Least Once</li>
<li>Exactly Once</li>
</ul>

<p>
解决消息重复问题：
</p>
<ul class="org-ul">
<li>将业务逻辑转化为幂等消费，At Least Once + 幂等消费 = Exactly Once
<ul class="org-ul">
<li>利用数据库的唯一性约束实现幂等。</li>
<li>为更新的数据设置前置条件。</li>
</ul></li>
<li>记录并检查操作。对每个操作设定 uuid。</li>
</ul>
</div>
</div>

<div id="outline-container-org86e5dbc" class="outline-2">
<h2 id="org86e5dbc"><span class="section-number-2">9</span> 消息积压了该如何处理</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>生产端：一般是业务逻辑问题。</li>
<li>消费端：
<ul class="org-ul">
<li>保证消费端的消费性能高于生产端的发送性能，这样的系统才能健康持续运行。</li>
<li>在扩充消费端实例数量的同事，必须同步扩容主题的分区（也叫队列）数量，确保消费端的实例数和分去数是相等的。因为每个分区只能支持单个消费者。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1aed39e" class="outline-2">
<h2 id="org1aed39e"><span class="section-number-2">10</span> 答疑解惑：网关如何接收服务端的秒杀结果</h2>
</div>

<div id="outline-container-orga3b0ad7" class="outline-2">
<h2 id="orga3b0ad7"><span class="section-number-2">11</span> 学习开源代码该如何入手</h2>
</div>

<div id="outline-container-org8978606" class="outline-2">
<h2 id="org8978606"><span class="section-number-2">12</span> 如何使用异步设计提升系统性能</h2>
</div>

<div id="outline-container-orgc71f975" class="outline-2">
<h2 id="orgc71f975"><span class="section-number-2">13</span> 如何实现高性能的异步网络传输</h2>
</div>

<div id="outline-container-orgf5d47cc" class="outline-2">
<h2 id="orgf5d47cc"><span class="section-number-2">14</span> 序列化和反序列化：如何通过网络传输结构化的数据</h2>
</div>

<div id="outline-container-org07ff662" class="outline-2">
<h2 id="org07ff662"><span class="section-number-2">15</span> 传输协议：应用程序之间对话的语言</h2>
</div>

<div id="outline-container-orgfb86512" class="outline-2">
<h2 id="orgfb86512"><span class="section-number-2">16</span> 内存管理：如何避免内存溢出和频繁的垃圾回收</h2>
</div>

<div id="outline-container-org0a41757" class="outline-2">
<h2 id="org0a41757"><span class="section-number-2">17</span> JMQ 的 Broker 如何异步处理消息</h2>
</div>

<div id="outline-container-orgd4b7ffd" class="outline-2">
<h2 id="orgd4b7ffd"><span class="section-number-2">18</span> Kafka 如何实现高性能 IO</h2>
</div>

<div id="outline-container-org2109e5e" class="outline-2">
<h2 id="org2109e5e"><span class="section-number-2">19</span> 缓存策略：如何私用缓存减少磁盘 IO</h2>
</div>

<div id="outline-container-org8c80d50" class="outline-2">
<h2 id="org8c80d50"><span class="section-number-2">20</span> 如何使用硬件同步源于（CAS）替代锁</h2>
</div>

<div id="outline-container-org97778f7" class="outline-2">
<h2 id="org97778f7"><span class="section-number-2">21</span> 数据压缩：时间换空间的游戏</h2>
</div>

<div id="outline-container-org7a481a8" class="outline-2">
<h2 id="org7a481a8"><span class="section-number-2">22</span> RocketMQ Producer 源码分析：消息生产的实现过程</h2>
</div>

<div id="outline-container-orgc121e67" class="outline-2">
<h2 id="orgc121e67"><span class="section-number-2">23</span> Kafka Consumer 源码分析：消息消费的实现过程</h2>
</div>

<div id="outline-container-orga563e8c" class="outline-2">
<h2 id="orga563e8c"><span class="section-number-2">24</span> Kafka 和 RocketMQ 的消息复制实现的差异点在哪</h2>
</div>

<div id="outline-container-org7de5f56" class="outline-2">
<h2 id="org7de5f56"><span class="section-number-2">25</span> Kafka 的协调服务 ZooKeeper：实现分布式系统的瑞士军刀</h2>
</div>

<div id="outline-container-org11d81ff" class="outline-2">
<h2 id="org11d81ff"><span class="section-number-2">26</span> RocketMQ 和 Kafka 如何实现事务</h2>
</div>

<div id="outline-container-orgb869c58" class="outline-2">
<h2 id="orgb869c58"><span class="section-number-2">27</span> MQTT 协议：如何支持海量的在线 IoT 设备</h2>
</div>

<div id="outline-container-org0fb9f73" class="outline-2">
<h2 id="org0fb9f73"><span class="section-number-2">28</span> Pulsar 的存储计算分离设计：全新的消息队列设计思路</h2>
</div>

<div id="outline-container-org7d9aa67" class="outline-2">
<h2 id="org7d9aa67"><span class="section-number-2">29</span> 答疑解惑：我的 100 元去哪里了</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:16</p>
<p class="validation"></p>
</div>
</body>
</html>
